In [10]:
import pandas as pd
import numpy as np

In [3]:
d = pd.Series()
# creating empty series

In [4]:
d

Series([], dtype: object)

In [5]:
type(d)

pandas.core.series.Series

In [6]:
# series with one element
d = pd.Series(17)

In [7]:
d

0    17
dtype: int64

In [8]:
# creating series using tuple
t = (10,11,12)
d = pd.Series(t)
d

0    10
1    11
2    12
dtype: int64

In [11]:
# creating series using list
d = pd.Series([10,20,30,40,50])
d

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [15]:
# creating series using array
arr = np.array([1,2,3,4,5,6])
d1 = pd.Series(arr)
d1

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int32

In [16]:
arr2= np.array([[1,2],[3,4],[5,6]])
arr2.shape

(3, 2)

In [18]:
# s2 = pd.Series(arr2)
# error -  Data must be 1-dimensional, got ndarray of shape (3, 2) instead

In [19]:
d

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [20]:
# Using dictionary
d={'a':1,'b':2,'c':3,'d':4}
d

{'a': 1, 'b': 2, 'c': 3, 'd': 4}

In [21]:
d.values()

dict_values([1, 2, 3, 4])

In [22]:
d.keys()

dict_keys(['a', 'b', 'c', 'd'])

In [23]:
d.items()

dict_items([('a', 1), ('b', 2), ('c', 3), ('d', 4)])

In [25]:
b = pd.Series(d)
b

a    1
b    2
c    3
d    4
dtype: int64

In [27]:
b['a']

1

In [30]:
# Slicing operation
d=pd.Series([1,2,3,5,47,98,7,8,6,32,78,2,8,289,258,78])
d[:-8:2]

0     1
2     3
4    47
6     7
dtype: int64

In [31]:
d[0:9]

0     1
1     2
2     3
3     5
4    47
5    98
6     7
7     8
8     6
dtype: int64

In [33]:
d[[4,5,6,7]] # multiple index

4    47
5    98
6     7
7     8
dtype: int64

In [35]:
d[4] = 8
d

0       1
1       2
2       3
3       5
4       8
5      98
6       7
7       8
8       6
9      32
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [36]:
d[6:10]=[100,200,300,400]
d

0       1
1       2
2       3
3       5
4       8
5      98
6     100
7     200
8     300
9     400
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [37]:
arr3=np.array([1,2,4,6])
s=pd.Series(arr3,index=['one','Two','Three','Four'])   
s

one      1
Two      2
Three    4
Four     6
dtype: int32

In [38]:
print(s)

one      1
Two      2
Three    4
Four     6
dtype: int32

# DataFrame

In [39]:
# empty dataframe
d=pd.DataFrame()

In [40]:
print(d)

Empty DataFrame
Columns: []
Index: []

In [41]:
d

Empty DataFrame
Columns: []
Index: []

In [42]:
print(type(d))

<class 'pandas.core.frame.DataFrame'>

In [43]:
data=[['abc',1],['def',2],['ghi',3],['','hij'],['klm','a']]
data

[['abc', 1], ['def', 2], ['ghi', 3], ['', 'hij'], ['klm', 'a']]

In [44]:
d1 = pd.DataFrame(data)
d1

     0    1
0  abc    1
1  def    2
2  ghi    3
3       hij
4  klm    a

In [46]:
d = pd.DataFrame(data,columns = ['A','B'], index = ['A','B','C','D','E'])
d

     A    B
A  abc    1
B  def    2
C  ghi    3
D       hij
E  klm    a

In [47]:
# dataframe using dictonary
data={'name':['a','b','c','d','e','f'],'age':[45,12,48,25,12,56]}

In [48]:
d = pd.DataFrame(data)
d

  name  age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f   56

In [49]:
d.rename({'name':'Candidate','age':'Age_years'},axis=1,inplace=True)

In [50]:
d

  Candidate  Age_years
0         a         45
1         b         12
2         c         48
3         d         25
4         e         12
5         f         56

In [51]:
# Accessing the elements from dataframe
data=[['ALex',10,'Maths'],['Bob',12,'Science'],['Kelly',15,'Eco'],
      ['Boris',14,'Geo'],['Ken',18,'English']]

In [52]:
data

[['ALex', 10, 'Maths'],
 ['Bob', 12, 'Science'],
 ['Kelly', 15, 'Eco'],
 ['Boris', 14, 'Geo'],
 ['Ken', 18, 'English']]

In [53]:
data[2][0]

'Kelly'

In [55]:
data[2][0]='asdf'

In [56]:
data

[['ALex', 10, 'Maths'],
 ['Bob', 12, 'Science'],
 ['asdf', 15, 'Eco'],
 ['Boris', 14, 'Geo'],
 ['Ken', 18, 'English']]

In [57]:
d = pd.DataFrame(data,columns=['Name','Age','Subject'])
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2   asdf   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [59]:
# d[1,1]

In [60]:
d.Name

0     ALex
1      Bob
2     asdf
3    Boris
4      Ken
Name: Name, dtype: object

In [61]:
d[['Name','Subject']]

    Name  Subject
0   ALex    Maths
1    Bob  Science
2   asdf      Eco
3  Boris      Geo
4    Ken  English

In [62]:
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2   asdf   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [63]:
d.iloc[1,1]

12

In [64]:
d.iloc[0,0] ="ALEX"  # changing an element

In [65]:
d

    Name  Age  Subject
0   ALEX   10    Maths
1    Bob   12  Science
2   asdf   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [66]:
d['Age'] = d['Age'] - 1   
d

    Name  Age  Subject
0   ALEX    9    Maths
1    Bob   11  Science
2   asdf   14      Eco
3  Boris   13      Geo
4    Ken   17  English

In [69]:
d.iloc[:,[0,1]] # index location

    Name  Age
0   ALEX    9
1    Bob   11
2   asdf   14
3  Boris   13
4    Ken   17

In [68]:
d.iloc[[3,1],[0,1]]  # [row,col]

    Name  Age
3  Boris   13
1    Bob   11

In [70]:
d.iloc[1:3,[0,1]]

   Name  Age
1   Bob   11
2  asdf   14

In [71]:
d.iloc[1]  # access row 1

Name           Bob
Age             11
Subject    Science
Name: 1, dtype: object

In [72]:
pwd

'C:\\Users\\sanik\\Downloads\\08-JUL-24-CDS-BUN-021-WDM10-PUN-20240829T174811Z-001\\08-JUL-24-CDS-BUN-021-WDM10-PUN\\MLA\\Pandas'

In [73]:
d

    Name  Age  Subject
0   ALEX    9    Maths
1    Bob   11  Science
2   asdf   14      Eco
3  Boris   13      Geo
4    Ken   17  English

In [74]:
# to acces the single element we use iloc it will always work with index
d.iloc[0,2] ## index of row ,columns

'Maths'

In [75]:
# loc will work on rows as well as names of columns
d.loc[:2,['Name','Subject']]

   Name  Subject
0  ALEX    Maths
1   Bob  Science
2  asdf      Eco

In [76]:
# Modify multiple values
d.iloc[:2,0]= ['abc','xyz']

In [77]:
d

    Name  Age  Subject
0    abc    9    Maths
1    xyz   11  Science
2   asdf   14      Eco
3  Boris   13      Geo
4    Ken   17  English

In [79]:
d['Age']

0     9
1    11
2    14
3    13
4    17
Name: Age, dtype: int64

In [80]:
d.loc[:,'Age']

0     9
1    11
2    14
3    13
4    17
Name: Age, dtype: int64

In [82]:
d.loc[3] # getting the rows with singular index value

Name       Boris
Age           13
Subject      Geo
Name: 3, dtype: object

In [83]:
d.iloc[:,[1,2]]

   Age  Subject
0    9    Maths
1   11  Science
2   14      Eco
3   13      Geo
4   17  English

In [84]:
d.iloc[:3,1:3]

   Age  Subject
0    9    Maths
1   11  Science
2   14      Eco